{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.7.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1000"}]}}}, "outputs": {"embeddings": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Shape", "op": "Shape", "input": ["input_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const", "op": "Const", "input": ["^input_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/axes", "op": "Const", "input": ["^input_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^input_2"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const_1", "op": "Const", "input": ["^input_2"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/ReadVariableOp", "op": "Const", "input": ["^input_2"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/free", "op": "Const", "input": ["^input_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2/axis", "op": "Const", "input": ["^input_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const_2", "op": "Const", "input": ["^input_2"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/concat_1/axis", "op": "Const", "input": ["^input_2"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Shape", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/axes", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Shape", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/free", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const_2", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Prod", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Reshape", "op": "Reshape", "input": ["input_2", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Reshape", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/MatMul", "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/ReadVariableOp", "shape": [1000, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/embeddings/StatefulPartitionedCall/StatefulPartitionedCall/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}]}]}